#include <stdio.h>		

// 3개의 숫자 입력받아 작은값부터 출력하기
int main() {

	while (1) {

		int 값1, 값2, 값3, 빈공간;

		printf("입력할 값을 3개 입력해주시길...");
		scanf_s("%d %d %d", &값1, &값2, &값3);

		if (값1 != 값2) {

			if (값1 > 값2) {

				빈공간 = 값2;
				값2 = 값1;
				값1 = 빈공간;
			}
		}

		if (값3 != 값2) {

			if (값2 > 값3) {

				빈공간 = 값3;
				값3 = 값2;
				값2 = 빈공간;
			}

		}

		if (값3 != 값1) {

			if (값1 > 값3) {

				빈공간 = 값3;
				값3 = 값1;
				값1 = 빈공간;
			}

		}

		if (값1 != 값2) {

			if (값1 > 값2) {

				빈공간 = 값2;
				값2 = 값1;
				값1 = 빈공간;
			}
		}

		printf("%d %d %d \n", 값1, 값2, 값3);

	}
	return 0;


}